In [21]:
import pandas as pd
df = pd.read_csv("datapoints.txt")
df.columns

Index(['(width (cm)', ' height (cm)', ' label (0-pichu', ' 1-pikachu))'], dtype='object')

In [ ]:
df = df.drop(" 1-pikachu))", axis = 1)

In [29]:
df["Pichu_Pikachu"] = df[" label (0-pichu"]
df

     (width (cm)   height (cm)   label (0-pichu  Pichu_Pikachu
0      21.959384     31.239567                0              0
1      23.635916     36.468215                1              1
2      17.714056     31.441704                0              0
3      21.780200     33.213398                1              1
4      25.206306     36.558816                1              1
..           ...           ...              ...            ...
145    18.990690     32.387963                0              0
146    23.542000     32.475193                0              0
147    19.640603     30.291557                0              0
148    21.989954     33.645903                1              1
149    22.302103     32.732379                0              0

[150 rows x 4 columns]

In [30]:
df = df.drop(" label (0-pichu", axis = 1)

In [31]:
df

     (width (cm)   height (cm)  Pichu_Pikachu
0      21.959384     31.239567              0
1      23.635916     36.468215              1
2      17.714056     31.441704              0
3      21.780200     33.213398              1
4      25.206306     36.558816              1
..           ...           ...            ...
145    18.990690     32.387963              0
146    23.542000     32.475193              0
147    19.640603     30.291557              0
148    21.989954     33.645903              1
149    22.302103     32.732379              0

[150 rows x 3 columns]

In [50]:
df.columns = df.columns.str.replace("(", "").str.replace(")", "").str.replace("_h", "H").str.capitalize()
df

      Width_cm  Height_cm  Pichu_pikachu
0    21.959384  31.239567              0
1    23.635916  36.468215              1
2    17.714056  31.441704              0
3    21.780200  33.213398              1
4    25.206306  36.558816              1
..         ...        ...            ...
145  18.990690  32.387963              0
146  23.542000  32.475193              0
147  19.640603  30.291557              0
148  21.989954  33.645903              1
149  22.302103  32.732379              0

[150 rows x 3 columns]

In [1]:
lt=[]
with open("testpoints.txt") as tf:
    vf = tf.readlines()
    for x in vf:
        lt.append(x)

lt

['Test points:\n',
 '1. (25, 32)\n',
 '2. (24.2, 31.5)\n',
 '3. (22, 34)\n',
 '4. (20.5, 34)\n']

In [5]:
import pandas as pd
test_data = pd.DataFrame(lt)

test_data

                   0
0     Test points:\n
1      1. (25, 32)\n
2  2. (24.2, 31.5)\n
3      3. (22, 34)\n
4    4. (20.5, 34)\n

In [ ]:
test_data = test_data.drop(0, axis = 0)

In [ ]:
test_data["Weight"] = test_data[0].str.split("(").str.get(1).str.split(",").str.get(0)
test_data["Height"] = test_data[0].str.split(")").str.get(0).str.split(",").str.get(1)
test_data

In [30]:
test_data

  Weight Height
1     25     32
2   24.2   31.5
3     22     34
4   20.5     34